Duet3D/Duet3Expansion/src/atmel/SAMD10_DFP/1.1.68/atdf/ATSAMD10C14A.atdf
        <register offset="0x00000314" size="4" name="NVICIPR5" initval="0" caption="Interrupt Priority Register 5">
          <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
          <bitfield mask="0x0000ff00" name="PRI21" caption="Priority of interrupt 21"/>
          <bitfield mask="0x00ff0000" name="PRI22" caption="Priority of interrupt 22"/>
          <bitfield mask="0xff000000" name="PRI23" caption="Priority of interrupt 23"/>
        </register>
        <register offset="0x00000318" size="4" name="NVICIPR6" initval="0" caption="Interrupt Priority Register 6">
          <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
          <bitfield mask="0x0000ff00" name="PRI25" caption="Priority of interrupt 25"/>
          <bitfield mask="0x00ff0000" name="PRI26" caption="Priority of interrupt 26"/>
          <bitfield mask="0xff000000" name="PRI27" caption="Priority of interrupt 27"/>
        </register>
        <register offset="0x0000031C" size="4" name="NVICIPR7" initval="0" caption="Interrupt Priority Register 7">
          <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
          <bitfield mask="0x0000ff00" name="PRI29" caption="Priority of interrupt 29"/>
          <bitfield mask="0x00ff0000" name="PRI30" caption="Priority of interrupt 30"/>
          <bitfield mask="0xff000000" name="PRI31" caption="Priority of interrupt 31"/>
        </register>
      </register-group>
    </module></modules>
  <pinouts>
    <pinout name="SAMD1xC" caption="SAMD1xC">
      <pin position="1" pad="PA05"/>
      <pin position="2" pad="PA08"/>
      <pin position="3" pad="PA09"/>
      <pin position="4" pad="PA14"/>
      <pin position="5" pad="PA15"/>
      <pin position="6" pad="PA28"/>
      <pin position="7" pad="PA30"/>
      <pin position="8" pad="PA31"/>
      <pin position="9" pad="PA24"/>
      <pin position="10" pad="PA25"/>
      <pin position="11" pad="GNDIO"/>
      <pin position="12" pad="VDDIO"/>
      <pin position="13" pad="PA02"/>
      <pin position="14" pad="PA04"/>
      <pin position="DB" pad="GNDANA"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>